/*
(i) Код попадает в итоговый файл,
только когда вызвана функция,
например functions.spollers();
Или когда импортирован весь файл,
например import "files/script.js";
Неиспользуемый (не вызванный)
код в итоговый файл не попадает.

Если мы хотим добавить модуль
следует его расскоментировать
*/

// Подключение основного файла стилей
import "../scss/style.scss";

// Плагины ============================================================================================================================================================================================================================================================================================================

/* Динамический адаптив */
//import "./libs/dynamic_adapt.js";

/* Форматирование чисел */
//import './libs/wNumb.min.js';

// Основные модули ========================================================================================================================================================================================================================================================
import * as functions from "./files/functions.js";

/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp из css  */
// functions.isWebp();
/* Добавление класса touch для HTML если браузер мобильный */
// functions.addTouchClass();
/* Добавление loaded для HTML после полной загрузки страницы */
// functions.addLoadedClass();
/* Модуль для работы с меню (Бургер) */
// functions.menuOpen();
/* Учет плавающей панели на мобильных устройствах при 100vh */
// functions.fullVHfix();

/*
Модуль работы со спойлерами
Документация:
Сниппет (HTML): spollers
*/
// (i) Для подключения в шаблон раскомментировать
// functions.spollers();

/*
Модуль работы с табами
Документация:
Сниппет (HTML): tabs
*/
// (i) Для подключения в шаблон раскомментировать
// functions.tabs();

/*
Модуль "показать еще"
Документация по работе в шаблоне:
Сниппет (HTML): showmore
*/
// (i) Для подключения в шаблон раскомментировать
// functions.showMore();

// Работа с формами ========================================================================================================================================================================================================================================================
import * as forms from "./files/forms/forms.js";

/* Работа с полями формы. Добавление классов, работа с placeholder */
// forms.formFieldsInit();

/* Oтправка формы со встроенной валидацией полей. false - отключит валидацию */
// forms.formSubmit(true);

/* Модуль формы "колличество" */
// forms.formQuantity();

/* Модуль формы "показать пароль" */
// forms.formViewpass();

/* Модуль звездного рейтинга */
// forms.formRating();

/* Модуль работы с select. Для включения ??? (подсказок в консоли) передать true */
// forms.formSelect(false);

// Модуль работы с ползунком (noUiSlider) ===================================================================================================================================================================================================================================================================================
/*
Подключение плагина ползунка noUiSlider и настройка выполняется в файле js/files/forms/nouislider.js
Документация по работе в шаблоне:
Документация плагина:
*/
// (i) Для подключения в шаблон раскомментировать
// import "./files/forms/nouislider.js";

// Модуль работы с попапами (hystmodal) ===================================================================================================================================================================================================================================================================================
/*
Подключение плагина hystModal и настройка выполняется в файле js/files/popups.js
Документация по работе в шаблоне:
Документация плагина: https://addmorescripts.github.io/hystModal/index_ru.html
Сниппет (HTML): pl 
*/
// (i) Для подключения в шаблон раскомментировать
// import "./files/popups.js";

// Модуль работы с подсказками (tippy) ====================================================================================================================================================================================================================================================================================
/*
Подключение плагина Tippy.js и настройка выполняется в файле js/files/tippy.js
Документация по работе в шаблоне:
Документация плагина: https://atomiks.github.io/tippyjs/
Сниппет (HTML): tip (добавляет атрибут с подсказкой для html тега)
*/
// (i) Для подключения в шаблон раскомментировать
// import "./files/tippy.js";

// Работа со слайдером (Swiper) ========================================================================================================================================================================================================================================================
/*
Настройка подключения плагина слайдера Swiper и новых слайдеров выполняется в файле js/files/sliders.js
Документация по работе в шаблоне:
Документация плагина: https://swiperjs.com/
Сниппет(HTML): swiper
*/
// (i) Для подключения в шаблон раскомментировать
// import "./files/sliders.js";

// Модули работы с прокруткой страницы ========================================================================================================================================================================================================================================================

/*
Изменение дизайна сролбара
Документация по работе в шаблоне: В HTML добавляем к блоку атрибут data-simplebar
Документация плагина: https://github.com/Grsmto/simplebar/tree/master/packages/simplebar
Сниппет(HTML): 
*/
// (i) Для подключения в шаблон раскомментировать
// import './files/scroll/simplebar.js';

/*
Ленивая (отложенная) загрузка картинок
Документация по работе в шаблоне: В HTML добавляем img, video, audio, iframe но вместо src пишем data-src
Документация плагина: https://github.com/verlok/vanilla-lazyload
Сниппет(HTML):
*/
// (i) Для подключения в шаблон раскомментировать
// import './files/scroll/lazyload.js';

// Функции работы скроллом ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
import * as sScroll from "./files/scroll/scroll.js";

// Наблюдатель за объектами c атрибутом data-watch
// Документация по работе в шаблоне: js/libs/watcher.js
// Сниппет(HTML):
// Для включения ??? (подсказок в консоли), указать параметр true
// (i) Для подключения в шаблон раскомментировать
// sScroll.scrollWatcher(false);

// Плавная навигация по странице
// (i) Для подключения в шаблон раскомментировать
// sScroll.pageNavigation();

// Галерея ========================================================================================================================================================================================================================================================

/*
Документация по работе в шаблоне: https://www.lightgalleryjs.com/docs/
Документация плагина: https://www.lightgalleryjs.com/docs/
Сниппет(HTML):
*/
// (i) Для подключения в шаблон раскомментировать
// import "./files/gallery.js";

// Прочее ========================================================================================================================================================================================================================================================
/* Подключаем файл со своим кодом */
import "./files/script.js";
//============================================================================================================================================================================================================================================
import { gsap } from "gsap";
gsap.fromTo(
  ".section-left__title",
  { x: -200, opacity: 0 },
  { x: 0, opacity: 1, duration: 1 }
);
gsap.fromTo(
  ".section-left__subtitle",
  { x: -250, opacity: 0 },
  { x: 0, opacity: 1, duration: 1, delay: 1 }
);
gsap.fromTo(
  ".section-right__title",
  { x: 250, opacity: 0 },
  { x: 0, opacity: 1, duration: 1 }
);
gsap.fromTo(
  ".features",
  { x: 200, opacity: 0 },
  { x: 0, opacity: 1, duration: 1, delay: 1 }
);
gsap.fromTo("button", { opacity: 0.1 }, { opacity: 1, duration: 2 });
gsap.to(".ball--big", {
  pixi: { rotation: "-170_short" },
  duration: 2,
});

gsap.fromTo(
  ".ball",
  { x: -200, y: -200, opacity: 0 },
  { x: 0, y: 0, opacity: 1, duration: 1, delay: 0.5 }
);
